GopalSaraf/Practicals/PSDL/include/proc/pic18f44k22.inc
// Register: SPBRG2
#define SPBRG2 SPBRG2
SPBRG2                                   equ 0F75h
// bitfield definitions
SPBRG2_SP2BRG_POSN                       equ 0000h
SPBRG2_SP2BRG_POSITION                   equ 0000h
SPBRG2_SP2BRG_SIZE                       equ 0008h
SPBRG2_SP2BRG_LENGTH                     equ 0008h
SPBRG2_SP2BRG_MASK                       equ 00FFh

// Register: SPBRGH2
#define SPBRGH2 SPBRGH2
SPBRGH2                                  equ 0F76h
// bitfield definitions
SPBRGH2_SP2BRGH_POSN                     equ 0000h
SPBRGH2_SP2BRGH_POSITION                 equ 0000h
SPBRGH2_SP2BRGH_SIZE                     equ 0008h
SPBRGH2_SP2BRGH_LENGTH                   equ 0008h
SPBRGH2_SP2BRGH_MASK                     equ 00FFh

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 0F77h
// bitfield definitions
CM2CON1_C2SYNC_POSN                      equ 0000h
CM2CON1_C2SYNC_POSITION                  equ 0000h
CM2CON1_C2SYNC_SIZE                      equ 0001h
CM2CON1_C2SYNC_LENGTH                    equ 0001h
CM2CON1_C2SYNC_MASK                      equ 0001h
CM2CON1_C1SYNC_POSN                      equ 0001h
CM2CON1_C1SYNC_POSITION                  equ 0001h
CM2CON1_C1SYNC_SIZE                      equ 0001h
CM2CON1_C1SYNC_LENGTH                    equ 0001h
CM2CON1_C1SYNC_MASK                      equ 0002h
CM2CON1_C2HYS_POSN                       equ 0002h
CM2CON1_C2HYS_POSITION                   equ 0002h
CM2CON1_C2HYS_SIZE                       equ 0001h
CM2CON1_C2HYS_LENGTH                     equ 0001h
CM2CON1_C2HYS_MASK                       equ 0004h
CM2CON1_C1HYS_POSN                       equ 0003h
CM2CON1_C1HYS_POSITION                   equ 0003h
CM2CON1_C1HYS_SIZE                       equ 0001h
CM2CON1_C1HYS_LENGTH                     equ 0001h
CM2CON1_C1HYS_MASK                       equ 0008h
CM2CON1_C2RSEL_POSN                      equ 0004h
CM2CON1_C2RSEL_POSITION                  equ 0004h
CM2CON1_C2RSEL_SIZE                      equ 0001h
CM2CON1_C2RSEL_LENGTH                    equ 0001h
CM2CON1_C2RSEL_MASK                      equ 0010h
CM2CON1_C1RSEL_POSN                      equ 0005h
CM2CON1_C1RSEL_POSITION                  equ 0005h
CM2CON1_C1RSEL_SIZE                      equ 0001h
CM2CON1_C1RSEL_LENGTH                    equ 0001h
CM2CON1_C1RSEL_MASK                      equ 0020h
CM2CON1_MC2OUT_POSN                      equ 0006h
CM2CON1_MC2OUT_POSITION                  equ 0006h
CM2CON1_MC2OUT_SIZE                      equ 0001h
CM2CON1_MC2OUT_LENGTH                    equ 0001h
CM2CON1_MC2OUT_MASK                      equ 0040h
CM2CON1_MC1OUT_POSN                      equ 0007h
CM2CON1_MC1OUT_POSITION                  equ 0007h
CM2CON1_MC1OUT_SIZE                      equ 0001h
CM2CON1_MC1OUT_LENGTH                    equ 0001h
CM2CON1_MC1OUT_MASK                      equ 0080h

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 0F78h
// bitfield definitions
CM2CON0_C2CH_POSN                        equ 0000h
CM2CON0_C2CH_POSITION                    equ 0000h
CM2CON0_C2CH_SIZE                        equ 0002h
CM2CON0_C2CH_LENGTH                      equ 0002h
CM2CON0_C2CH_MASK                        equ 0003h
CM2CON0_C2R_POSN                         equ 0002h
CM2CON0_C2R_POSITION                     equ 0002h
CM2CON0_C2R_SIZE                         equ 0001h
CM2CON0_C2R_LENGTH                       equ 0001h
CM2CON0_C2R_MASK                         equ 0004h
CM2CON0_C2SP_POSN                        equ 0003h
CM2CON0_C2SP_POSITION                    equ 0003h
CM2CON0_C2SP_SIZE                        equ 0001h
CM2CON0_C2SP_LENGTH                      equ 0001h
CM2CON0_C2SP_MASK                        equ 0008h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OE_POSN                        equ 0005h
CM2CON0_C2OE_POSITION                    equ 0005h
CM2CON0_C2OE_SIZE                        equ 0001h
CM2CON0_C2OE_LENGTH                      equ 0001h
CM2CON0_C2OE_MASK                        equ 0020h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2ON_POSN                        equ 0007h
CM2CON0_C2ON_POSITION                    equ 0007h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0080h
CM2CON0_C2CH0_POSN                       equ 0000h
CM2CON0_C2CH0_POSITION                   equ 0000h
CM2CON0_C2CH0_SIZE                       equ 0001h
CM2CON0_C2CH0_LENGTH                     equ 0001h
CM2CON0_C2CH0_MASK                       equ 0001h
CM2CON0_C2CH1_POSN                       equ 0001h
CM2CON0_C2CH1_POSITION                   equ 0001h
CM2CON0_C2CH1_SIZE                       equ 0001h
CM2CON0_C2CH1_LENGTH                     equ 0001h
CM2CON0_C2CH1_MASK                       equ 0002h
CM2CON0_CCH02_POSN                       equ 0000h
CM2CON0_CCH02_POSITION                   equ 0000h
CM2CON0_CCH02_SIZE                       equ 0001h
CM2CON0_CCH02_LENGTH                     equ 0001h
CM2CON0_CCH02_MASK                       equ 0001h
CM2CON0_CCH12_POSN                       equ 0001h
CM2CON0_CCH12_POSITION                   equ 0001h
CM2CON0_CCH12_SIZE                       equ 0001h
CM2CON0_CCH12_LENGTH                     equ 0001h
CM2CON0_CCH12_MASK                       equ 0002h
CM2CON0_COE2_POSN                        equ 0006h
CM2CON0_COE2_POSITION                    equ 0006h
CM2CON0_COE2_SIZE                        equ 0001h
CM2CON0_COE2_LENGTH                      equ 0001h
CM2CON0_COE2_MASK                        equ 0040h
CM2CON0_CON2_POSN                        equ 0007h
CM2CON0_CON2_POSITION                    equ 0007h
CM2CON0_CON2_SIZE                        equ 0001h
CM2CON0_CON2_LENGTH                      equ 0001h
CM2CON0_CON2_MASK                        equ 0080h
CM2CON0_CPOL2_POSN                       equ 0005h
CM2CON0_CPOL2_POSITION                   equ 0005h
CM2CON0_CPOL2_SIZE                       equ 0001h
CM2CON0_CPOL2_LENGTH                     equ 0001h
CM2CON0_CPOL2_MASK                       equ 0020h
CM2CON0_CREF2_POSN                       equ 0002h
CM2CON0_CREF2_POSITION                   equ 0002h
CM2CON0_CREF2_SIZE                       equ 0001h
CM2CON0_CREF2_LENGTH                     equ 0001h
CM2CON0_CREF2_MASK                       equ 0004h
CM2CON0_EVPOL02_POSN                     equ 0003h
CM2CON0_EVPOL02_POSITION                 equ 0003h
CM2CON0_EVPOL02_SIZE                     equ 0001h
CM2CON0_EVPOL02_LENGTH                   equ 0001h
CM2CON0_EVPOL02_MASK                     equ 0008h
CM2CON0_EVPOL12_POSN                     equ 0004h
CM2CON0_EVPOL12_POSITION                 equ 0004h
CM2CON0_EVPOL12_SIZE                     equ 0001h
CM2CON0_EVPOL12_LENGTH                   equ 0001h
CM2CON0_EVPOL12_MASK                     equ 0010h

// Register: CM1CON0
#define CM1CON0 CM1CON0
CM1CON0                                  equ 0F79h
// bitfield definitions
CM1CON0_C1CH_POSN                        equ 0000h
CM1CON0_C1CH_POSITION                    equ 0000h
CM1CON0_C1CH_SIZE                        equ 0002h
CM1CON0_C1CH_LENGTH                      equ 0002h
CM1CON0_C1CH_MASK                        equ 0003h
CM1CON0_C1R_POSN                         equ 0002h
CM1CON0_C1R_POSITION                     equ 0002h
CM1CON0_C1R_SIZE                         equ 0001h
CM1CON0_C1R_LENGTH                       equ 0001h
CM1CON0_C1R_MASK                         equ 0004h
CM1CON0_C1SP_POSN                        equ 0003h
CM1CON0_C1SP_POSITION                    equ 0003h
CM1CON0_C1SP_SIZE                        equ 0001h
CM1CON0_C1SP_LENGTH                      equ 0001h
CM1CON0_C1SP_MASK                        equ 0008h
CM1CON0_C1POL_POSN                       equ 0004h
CM1CON0_C1POL_POSITION                   equ 0004h
CM1CON0_C1POL_SIZE                       equ 0001h
CM1CON0_C1POL_LENGTH                     equ 0001h
CM1CON0_C1POL_MASK                       equ 0010h
CM1CON0_C1OE_POSN                        equ 0005h
CM1CON0_C1OE_POSITION                    equ 0005h
CM1CON0_C1OE_SIZE                        equ 0001h
CM1CON0_C1OE_LENGTH                      equ 0001h
CM1CON0_C1OE_MASK                        equ 0020h
CM1CON0_C1OUT_POSN                       equ 0006h
CM1CON0_C1OUT_POSITION                   equ 0006h
CM1CON0_C1OUT_SIZE                       equ 0001h
CM1CON0_C1OUT_LENGTH                     equ 0001h
CM1CON0_C1OUT_MASK                       equ 0040h
CM1CON0_C1ON_POSN                        equ 0007h
CM1CON0_C1ON_POSITION                    equ 0007h
CM1CON0_C1ON_SIZE                        equ 0001h
CM1CON0_C1ON_LENGTH                      equ 0001h
CM1CON0_C1ON_MASK                        equ 0080h
CM1CON0_C1CH0_POSN                       equ 0000h
CM1CON0_C1CH0_POSITION                   equ 0000h
CM1CON0_C1CH0_SIZE                       equ 0001h
CM1CON0_C1CH0_LENGTH                     equ 0001h
CM1CON0_C1CH0_MASK                       equ 0001h
CM1CON0_C1CH1_POSN                       equ 0001h
CM1CON0_C1CH1_POSITION                   equ 0001h
CM1CON0_C1CH1_SIZE                       equ 0001h
CM1CON0_C1CH1_LENGTH                     equ 0001h
CM1CON0_C1CH1_MASK                       equ 0002h
CM1CON0_CCH0_POSN                        equ 0000h
CM1CON0_CCH0_POSITION                    equ 0000h
CM1CON0_CCH0_SIZE                        equ 0001h
CM1CON0_CCH0_LENGTH                      equ 0001h
CM1CON0_CCH0_MASK                        equ 0001h
CM1CON0_CCH01_POSN                       equ 0000h
CM1CON0_CCH01_POSITION                   equ 0000h
CM1CON0_CCH01_SIZE                       equ 0001h
CM1CON0_CCH01_LENGTH                     equ 0001h
CM1CON0_CCH01_MASK                       equ 0001h
CM1CON0_CCH1_POSN                        equ 0001h
CM1CON0_CCH1_POSITION                    equ 0001h
CM1CON0_CCH1_SIZE                        equ 0001h
CM1CON0_CCH1_LENGTH                      equ 0001h
CM1CON0_CCH1_MASK                        equ 0002h
CM1CON0_CCH11_POSN                       equ 0001h
CM1CON0_CCH11_POSITION                   equ 0001h
CM1CON0_CCH11_SIZE                       equ 0001h
CM1CON0_CCH11_LENGTH                     equ 0001h
CM1CON0_CCH11_MASK                       equ 0002h
CM1CON0_COE_POSN                         equ 0006h
CM1CON0_COE_POSITION                     equ 0006h
CM1CON0_COE_SIZE                         equ 0001h
CM1CON0_COE_LENGTH                       equ 0001h
CM1CON0_COE_MASK                         equ 0040h
CM1CON0_COE1_POSN                        equ 0006h
CM1CON0_COE1_POSITION                    equ 0006h
CM1CON0_COE1_SIZE                        equ 0001h
CM1CON0_COE1_LENGTH                      equ 0001h
CM1CON0_COE1_MASK                        equ 0040h
CM1CON0_CON_POSN                         equ 0007h
CM1CON0_CON_POSITION                     equ 0007h
CM1CON0_CON_SIZE                         equ 0001h
CM1CON0_CON_LENGTH                       equ 0001h
CM1CON0_CON_MASK                         equ 0080h
CM1CON0_CON1_POSN                        equ 0007h
CM1CON0_CON1_POSITION                    equ 0007h
CM1CON0_CON1_SIZE                        equ 0001h
CM1CON0_CON1_LENGTH                      equ 0001h
CM1CON0_CON1_MASK                        equ 0080h
CM1CON0_CPOL_POSN                        equ 0005h
CM1CON0_CPOL_POSITION                    equ 0005h
CM1CON0_CPOL_SIZE                        equ 0001h
CM1CON0_CPOL_LENGTH                      equ 0001h
CM1CON0_CPOL_MASK                        equ 0020h
CM1CON0_CPOL1_POSN                       equ 0005h
CM1CON0_CPOL1_POSITION                   equ 0005h
CM1CON0_CPOL1_SIZE                       equ 0001h
CM1CON0_CPOL1_LENGTH                     equ 0001h
CM1CON0_CPOL1_MASK                       equ 0020h
CM1CON0_CREF_POSN                        equ 0002h
CM1CON0_CREF_POSITION                    equ 0002h
CM1CON0_CREF_SIZE                        equ 0001h
CM1CON0_CREF_LENGTH                      equ 0001h
CM1CON0_CREF_MASK                        equ 0004h
CM1CON0_CREF1_POSN                       equ 0002h
CM1CON0_CREF1_POSITION                   equ 0002h
CM1CON0_CREF1_SIZE                       equ 0001h
CM1CON0_CREF1_LENGTH                     equ 0001h
CM1CON0_CREF1_MASK                       equ 0004h
CM1CON0_EVPOL0_POSN                      equ 0003h
CM1CON0_EVPOL0_POSITION                  equ 0003h
CM1CON0_EVPOL0_SIZE                      equ 0001h
CM1CON0_EVPOL0_LENGTH                    equ 0001h
CM1CON0_EVPOL0_MASK                      equ 0008h
CM1CON0_EVPOL01_POSN                     equ 0003h
CM1CON0_EVPOL01_POSITION                 equ 0003h
CM1CON0_EVPOL01_SIZE                     equ 0001h
CM1CON0_EVPOL01_LENGTH                   equ 0001h
CM1CON0_EVPOL01_MASK                     equ 0008h
CM1CON0_EVPOL1_POSN                      equ 0004h
CM1CON0_EVPOL1_POSITION                  equ 0004h
CM1CON0_EVPOL1_SIZE                      equ 0001h
CM1CON0_EVPOL1_LENGTH                    equ 0001h
CM1CON0_EVPOL1_MASK                      equ 0010h
CM1CON0_EVPOL11_POSN                     equ 0004h
CM1CON0_EVPOL11_POSITION                 equ 0004h
CM1CON0_EVPOL11_SIZE                     equ 0001h
CM1CON0_EVPOL11_LENGTH                   equ 0001h
CM1CON0_EVPOL11_MASK                     equ 0010h

